app/controllers/profiles_controller.rb

SELECT `profiles`.* FROM `profiles`
---
  def index
    @profiles = Profile.all

INSERT INTO `profiles` (`first_name`, `second_name`, `first_last_name`, `second_last_name`, `birth_date`, `curp`, `rfc`, `gender`, `birth_state`, `phone_number`, `user_id`, `created_at`, `updated_at`) VALUES ('Diego', 'Alejandro', 'Ramírez', 'Ortega', '30-12-92', 'MOFD930830HNENRG0', 'DIEGOLELELE', 'Masculino', 'Chiapas', '+5215585326754', 1, '2017-01-16 03:51:15', '2017-01-16 03:51:15')
---
  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = NULL LIMIT 1
---
    def set_profile
      @profile = Profile.find(params[:id])