app/controllers/requisitions_controller.rb

SELECT `requisitions`.* FROM `requisitions`
---
  def index
    @requisitions = Requisition.all

INSERT INTO `requisitions` (`income`, `address_years`, `company_years`, `marital_status`, `requested_amount`, `payment_terms`, `bank`, `comment`, `company_name`, `company_phone_number`, `dependents_number`, `company_position`, `has_sgmm`, `has_imss`, `has_car`, `profile_id`, `created_at`, `updated_at`) VALUES ('35000', '2.5', '3', 'Soltero', '25000', 'Varios', 'Santander', 'Varios comentarios', 'P&G', '018003890987', '+521556732344', 'Sr. KAM', '1', '0', '1', 1, '2017-01-17 02:42:44', '2017-01-17 02:42:44')
---
  def create
    @requisition = Requisition.new(requisition_params)

    respond_to do |format|
      if @requisition.save

SELECT  `requisitions`.* FROM `requisitions` WHERE `requisitions`.`id` = 1 LIMIT 1
---
    def set_requisition
      @requisition = Requisition.find(params[:id])