app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'diego@test.com' LIMIT 1
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
---
	def create
		puts "LOG: Creating a new session"
		user_email = params[:user][:email]
		user_password = params[:user][:password]
		user = User.find_by(email: user_email).try(:authenticate, user_password)

		if user
			session[:user_id] = user_id
			redirect_to root_path, notice: "¡Bienvenido#{(' ' + user.profile.all_names) unless user.profile.all_names.empty?}!"