app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    puts "LOG: got user params #{user_params}"
    puts "LOG: User email: #{@user.email}. Password: #{@user.password}"

    # Check if empty
    # if @user.password.empty? || @user.email.empty?
    #   flash[:notice] = "Hay campos vacíos."
    #   return
    # end

    # Check if user already exists
    if User.find_by(email: @user.email)
      flash[:notice] = "El usuario ya existe."
      return
    end

    # Check if user and password do not match
    # if @user.password != @user.password_digest
    #   flash[:notice] = "Las contraseñas no coinciden."
    #   return
    # end

    # @user.password_digest = nil

    # TO-DO: facebook stuff

    respond_to do |format|
      if @user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'diego@test.com' LIMIT 1
INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('diego@test.com', '$2a$10$0Aqd.Gd.Rns0AtayxpKnz.Q32/FY2YMpaf3D5WcajngqWgUTbyBiG', '2017-01-16 02:16:02', '2017-01-16 02:16:02')